[
    {
        "name": "Fehu",
        "old_norse_name": "Fehu",
        "essence_summary": "The fire of vitality, the primal spark of new life. Wealth, not just material, but energetic and spiritual. Prosperity cultivated through wise stewardship.",
        "light_aspect": "Fehu blesses you with abundance — the kind that feeds body, heart, and spirit. It is the joyful tending of what grows.",
        "shadow_aspect": "Greed. Clinging. Mismanagement of gifts. When wealth is hoarded, it rots. When worth is chased externally, the soul withers.",
        "material_meaning": "A fertile period for beginnings: financial growth, business opportunities, investments of energy that bear fruit if properly nurtured.",
        "emotional_spiritual_meaning": "Recognizing your intrinsic value, not through accumulation, but through authentic presence. Learning that wealth begins within.",
        "elemental_force": "Earth infused by Fire",
        "deity_connection": "Freyr"
    },
    {
        "name": "Uruz",
        "old_norse_name": "Úr",
        "essence_summary": "The primal strength of the aurochs. Raw vitality, physical power, and the inner will that bends reality into form.",
        "light_aspect": "Courage surges. Vital forces align to build, endure, and triumph through sheer life-force.",
        "shadow_aspect": "Brutality. Losing oneself to primal impulse. Wasting energy in rage or recklessness.",
        "material_meaning": "Opportunities to challenge physical limits: career climbs, health goals, survivalist moves — all require steady, fearless momentum.",
        "emotional_spiritual_meaning": "A call to respect the body as temple and teacher. Strength is not domination — it is devotion to vitality.",
        "elemental_force": "Earth animated by primal Fire",
        "deity_connection": "Thor"
    },
    {
        "name": "Thurisaz",
        "old_norse_name": "Thurs",
        "essence_summary": "The thorn, the gatekeeper. A warning and a weapon. Sacred confrontation with external forces or inner demons.",
        "light_aspect": "Defend your soul’s garden without apology. True power is forged in deliberate, conscious defense.",
        "shadow_aspect": "Becoming reactionary, destructive, abusive in anger. Using the hammer when the hand was needed.",
        "material_meaning": "Conflict arises; prepare. The wise shield, not the blind sword, protects victory.",
        "emotional_spiritual_meaning": "Time to confront suppressed rage, betrayal, or fear that has calcified into defense mechanisms.",
        "elemental_force": "Fire crackling through Air",
        "deity_connection": "Thor"
    },
    {
        "name": "Ansuz",
        "old_norse_name": "Óss",
        "essence_summary": "The sacred breath. Communication from the gods, divine inspiration, language as magic.",
        "light_aspect": "Clarity of voice, transmission of wisdom, messages received and transmitted with purity.",
        "shadow_aspect": "Deception, manipulation, misinformation. Speaking without truth, listening without heart.",
        "material_meaning": "Contracts, negotiations, important conversations, learning or teaching opportunities — all communication-centered events are blessed (or tested).",
        "emotional_spiritual_meaning": "A call to listen — not just with ears, but with intuition. Truth often comes in whispers.",
        "elemental_force": "Air — the carrier of speech, thought, spirit.",
        "deity_connection": "Odin"
    },
    {
        "name": "Raidho",
        "old_norse_name": "Reið",
        "essence_summary": "The wheel turning. Journey, rightful order, movement along life’s intended path.",
        "light_aspect": "Progress, right action, momentum aligned with destiny rather than ego.",
        "shadow_aspect": "Stubborn detours, resisting the journey’s lessons, trying to force a path not yours.",
        "material_meaning": "Physical travel, life shifts, movement in career or residence. Important transitions unfolding.",
        "emotional_spiritual_meaning": "Learning to trust that growth is not always linear. Sometimes a curve is not a mistake, but a deeper path unfolding.",
        "elemental_force": "Air moving the Wheel — guidance by unseen winds.",
        "deity_connection": "Forseti"
    },
    {
        "name": "Kenaz",
        "old_norse_name": "Kaun",
        "essence_summary": "The torch of illumination. Creativity, knowledge, skill, the inner fire that crafts and transforms.",
        "light_aspect": "Kenaz grants you sight beyond darkness — the ability to shape your reality through skill, understanding, and art.",
        "shadow_aspect": "Burnout. Corruption of knowledge. Using light to blind instead of reveal.",
        "material_meaning": "Opportunities for learning, creative projects, technical mastery, or innovation.",
        "emotional_spiritual_meaning": "Awakening a hidden passion. The soul’s hunger for meaning through creation, not consumption.",
        "elemental_force": "Fire — focused, creative, contained yet potent.",
        "deity_connection": "Heimdall"
    },
    {
        "name": "Gebo",
        "old_norse_name": "Gjöf",
        "essence_summary": "The sacred exchange. Gift, balance, relationship, mutual honoring.",
        "light_aspect": "Blessings through reciprocity. Genuine giving creates genuine abundance.",
        "shadow_aspect": "Transactional love. Hidden obligations disguised as generosity.",
        "material_meaning": "Contracts, partnerships, alliances — if mutual, they thrive; if unbalanced, they wither.",
        "emotional_spiritual_meaning": "True connection demands vulnerability and authenticity, not silent barter.",
        "elemental_force": "Water — flowing between two banks, nourishing both sides.",
        "deity_connection": "Gefjon"
    },
    {
        "name": "Wunjo",
        "old_norse_name": "Vin",
        "essence_summary": "Joy, harmony, fellowship, the song of soul made manifest.",
        "light_aspect": "Wunjo sings of success, unity, personal happiness, and shared triumph.",
        "shadow_aspect": "False happiness. Joy sought through external validation instead of internal alignment.",
        "material_meaning": "Success in projects, relationships, and personal efforts — but only if joy is genuine, not performative.",
        "emotional_spiritual_meaning": "Celebration of self-worth, community, and the lightness of being alive.",
        "elemental_force": "Water + Air — emotional currents uplifted into song.",
        "deity_connection": "Baldur"
    },
    {
        "name": "Hagalaz",
        "old_norse_name": "Hagl",
        "essence_summary": "The storm. Destruction, upheaval, natural forces beyond control — and cleansing renewal.",
        "light_aspect": "The storm clears dead branches and waters seeds unseen. Trust the necessary destruction.",
        "shadow_aspect": "Fear of loss. Clinging to what should have been surrendered seasons ago.",
        "material_meaning": "Unexpected disruptions. Plans upended. Structures fall, but only where renewal is overdue.",
        "emotional_spiritual_meaning": "Transformation through surrender, not through control.",
        "elemental_force": "Water in violent motion — hail, flood, tempest.",
        "deity_connection": "Hel"
    },
    {
        "name": "Nauthiz",
        "old_norse_name": "Nauðr",
        "essence_summary": "The need-fire. Resistance, friction, hardship that tempers the soul.",
        "light_aspect": "Strength through endurance. Wisdom through scarcity. Creation through necessity.",
        "shadow_aspect": "Victimhood, self-pity, bitterness toward trials meant to sharpen.",
        "material_meaning": "Delays, financial strain, tension in progress. Creativity must arise from within, not external resources.",
        "emotional_spiritual_meaning": "Building self-reliance. Meeting your needs rather than expecting others to fulfill them.",
        "elemental_force": "Fire constrained by resistance — the slow burn that forges strength.",
        "deity_connection": "Skuld"
    },
    {
        "name": "Isa",
        "old_norse_name": "Íss",
        "essence_summary": "The ice mirror. Stillness, reflection, the sacred pause between movements.",
        "light_aspect": "Wisdom in rest. The sacred art of waiting without fear, holding stillness as strength.",
        "shadow_aspect": "Paralysis. Refusing growth. Becoming frozen in fear, depression, or isolation.",
        "material_meaning": "Delays in plans, freezing of negotiations or forward momentum. Not failure — hibernation.",
        "emotional_spiritual_meaning": "Deep introspection. A call to see yourself truthfully in the still waters of your soul.",
        "elemental_force": "Water, frozen into clarity.",
        "deity_connection": "Verdandi"
    },
    {
        "name": "Jera",
        "old_norse_name": "Járn",
        "essence_summary": "The harvest wheel. Natural cycles, reward through steady effort, karma unfolding.",
        "light_aspect": "Fruition of long work. Blessings that are earned, not given. Patience rewarded.",
        "shadow_aspect": "Impatience. Trying to harvest seeds before they are ripe. Frustration with natural timing.",
        "material_meaning": "Prosperity, completion of cycles — projects, relationships, or literal harvests.",
        "emotional_spiritual_meaning": "Trust in timing. Growth is invisible before it is inevitable.",
        "elemental_force": "Earth moving through Water — growth through natural flow.",
        "deity_connection": "Sif"
    },
    {
        "name": "Eihwaz",
        "old_norse_name": "Eoh",
        "essence_summary": "The yew tree. Death, rebirth, initiation into profound transformation.",
        "light_aspect": "Endurance beyond endings. Transformation that blesses even through destruction.",
        "shadow_aspect": "Fear of death, fear of change. Clinging to what must decay to nourish the next life.",
        "material_meaning": "Major shifts: endings of jobs, homes, or relationships that clear paths for deep new beginnings.",
        "emotional_spiritual_meaning": "Facing mortality, loss, or ego death — not as punishment, but as sacred passage.",
        "elemental_force": "Fire and Water entwined — the alchemy of change.",
        "deity_connection": "Yggdrasil"
    },
    {
        "name": "Perthro",
        "old_norse_name": "Perð",
        "essence_summary": "The hidden well. Mystery, fate, the womb of the unknown, the unrolled dice of becoming.",
        "light_aspect": "Trust in the unseen. The acceptance that mystery holds its own wisdom and timing.",
        "shadow_aspect": "Fear of uncertainty. Grasping for control in what must remain in divine hands.",
        "material_meaning": "Unforeseen twists, luck (good or ill depending on preparation), hidden influences in work or relationships.",
        "emotional_spiritual_meaning": "Deep soul mysteries arising. Subconscious patterns, ancestral echoes coming to surface.",
        "elemental_force": "Water — dark, deep, intuitive.",
        "deity_connection": "Frigg"
    },
    {
        "name": "Algiz",
        "old_norse_name": "Elgr",
        "essence_summary": "The elk’s protection. Guardianship, sanctuary, connection to higher powers and self-preservation.",
        "light_aspect": "Divine protection. Sacred boundaries fortified. Awareness of what threatens or supports your spirit.",
        "shadow_aspect": "False security. Overprotection leading to isolation or blindness to necessary risk.",
        "material_meaning": "Safety in contracts, relationships, physical movement. Protection is available, but discernment is needed.",
        "emotional_spiritual_meaning": "Connection to higher self, guides, ancestral protectors. A call to listen to intuitive alarms.",
        "elemental_force": "Air rising through Earth — instinct made conscious.",
        "deity_connection": "Heimdall"
    },
    {
        "name": "Sowilo",
        "old_norse_name": "Sól",
        "essence_summary": "The sun wheel. Victory, illumination, radiance, divine guidance revealed.",
        "light_aspect": "Clarity and confidence. Success not from ego, but from alignment with your soul’s truth.",
        "shadow_aspect": "Arrogance. Burnout. Mistaking the spotlight for the path, or radiance for righteousness.",
        "material_meaning": "Triumph in career, projects, visibility, or reputation. A time to shine — but stay grounded.",
        "emotional_spiritual_meaning": "The solar self — pure willpower, heart-centered confidence, unapologetic joy.",
        "elemental_force": "Fire — direct, focused, bright, and generative.",
        "deity_connection": "Sunna"
    },
    {
        "name": "Tiwaz",
        "old_norse_name": "Týr",
        "essence_summary": "The spear of justice. Sacrifice, integrity, truth upheld even when it costs you.",
        "light_aspect": "Steadfast honor. The courage to take a moral stand, to lead with your whole heart.",
        "shadow_aspect": "Martyrdom, rigidity, or self-sacrifice for causes that no longer serve your soul.",
        "material_meaning": "Legal matters, contracts, decisions requiring ethics over convenience. A call to act with integrity.",
        "emotional_spiritual_meaning": "Aligning your actions with your inner truth. Reclaiming the warrior within, not in battle, but in purpose.",
        "elemental_force": "Air as sacred oath — sharp, clear, and unwavering.",
        "deity_connection": "Tyr"
    },
    {
        "name": "Berkano",
        "old_norse_name": "Bjarkan",
        "essence_summary": "The birch mother. Fertility, healing, creation, feminine renewal, and protective love.",
        "light_aspect": "New beginnings nurtured in safety. Growth that is quiet, slow, and tender.",
        "shadow_aspect": "Smothering. Over-nurturing. Stagnation through fear of leaving the womb.",
        "material_meaning": "New projects, family matters, fertility (literal or metaphorical), maternal themes emerging.",
        "emotional_spiritual_meaning": "Healing the inner child. Reclaiming softness as strength. Tending to the parts of you left behind.",
        "elemental_force": "Earth — fertile, protected, patient.",
        "deity_connection": "Frigg"
    },
    {
        "name": "Ehwaz",
        "old_norse_name": "Eh",
        "essence_summary": "The twin horses. Movement, trust, partnership, momentum born from mutual purpose.",
        "light_aspect": "Aligned action through connection. Sacred journeys made possible by shared intent.",
        "shadow_aspect": "Mistrust, imbalance in relationships, pushing or pulling when cooperation is needed.",
        "material_meaning": "Physical travel, business partnerships, co-creative ventures — all thrive through balance.",
        "emotional_spiritual_meaning": "Trusting others as a reflection of how much you trust yourself. Lean in, or let go.",
        "elemental_force": "Air and Earth — movement that is grounded.",
        "deity_connection": "Freyr"
    },
    {
        "name": "Mannaz",
        "old_norse_name": "Maðr",
        "essence_summary": "The self in community. Humanity, identity, collective consciousness, self-awareness.",
        "light_aspect": "The beauty of interconnection. Understanding yourself through others, and others through self.",
        "shadow_aspect": "Ego, isolation, self-importance, or over-dependence on external validation.",
        "material_meaning": "Social dynamics, teamwork, leadership roles. You are seen — but how do you show up?",
        "emotional_spiritual_meaning": "Time to look in the mirror of your relationships. What you see in others reflects your own becoming.",
        "elemental_force": "Air — mental clarity and the breath of shared understanding.",
        "deity_connection": "Odin"
    },
    {
        "name": "Laguz",
        "old_norse_name": "Lögr",
        "essence_summary": "The flow. Intuition, emotion, dreams, the great river of the subconscious.",
        "light_aspect": "Emotional clarity. Trusting your inner tide. Allowing your instincts to guide without needing proof.",
        "shadow_aspect": "Emotional overwhelm, avoidance, drowning in illusion or codependency.",
        "material_meaning": "Creative or intuitive work flows easily if you follow the current, not fight it. Beware of passive stagnation.",
        "emotional_spiritual_meaning": "You are being invited to surrender — not as weakness, but as divine realignment. Let the water cleanse what the mind resists.",
        "elemental_force": "Water — deep, psychic, cyclical.",
        "deity_connection": "Njord"
    },
    {
        "name": "Ingwaz",
        "old_norse_name": "Yngvi",
        "essence_summary": "The seed. Inner potential, gestation, sacred pause before emergence.",
        "light_aspect": "Quiet power. Unseen growth. Wholeness cultivated in still soil.",
        "shadow_aspect": "Restlessness. Forcing something to bloom before it’s ready. Fear of being unseen.",
        "material_meaning": "Your efforts are not wasted — they are incubating. Let the process complete before making demands of it.",
        "emotional_spiritual_meaning": "A powerful time to retreat inward, to gestate something meaningful — a part of your soul or your future.",
        "elemental_force": "Earth with hidden Fire — fertile, humming with life beneath stillness.",
        "deity_connection": "Freyr (Ing)"
    },
    {
        "name": "Dagaz",
        "old_norse_name": "Dagr",
        "essence_summary": "The dawn. Breakthrough, awakening, sudden clarity. A new beginning kissed by light.",
        "light_aspect": "Revelation. Transformation through awareness. A cycle closing, another opening — with joy.",
        "shadow_aspect": "Resistance to change. Refusing to leave the night for fear of its comfort.",
        "material_meaning": "A huge shift is here or near. Clarity in business, lifestyle, relationships — the fog lifts.",
        "emotional_spiritual_meaning": "You are waking up to yourself. Integration is possible now — both shadow and light, both past and future.",
        "elemental_force": "Fire and Air at dawn — illuminating, rising, expansive.",
        "deity_connection": "Baldur reborn"
    },
    {
        "name": "Othala",
        "old_norse_name": "Oðal",
        "essence_summary": "The inheritance. Ancestry, legacy, belonging, sacred land, and lineage wisdom.",
        "light_aspect": "Claiming your roots, owning your story, and honoring what you’ve inherited — both blood and soul.",
        "shadow_aspect": "Clinging to outdated traditions, family wounds, or ideas of 'home' that no longer fit.",
        "material_meaning": "Real estate, financial inheritance, family dynamics — but more importantly, the question of 'what do you carry forward?'",
        "emotional_spiritual_meaning": "You are being asked to connect to your lineage — chosen or blood — and decide what you wish to pass on, and what ends with you.",
        "elemental_force": "Earth — sacred, ancient, rooted.",
        "deity_connection": "Odin as Ancestor"
    }
]